minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
#include <ESP8266NetBIOS.h>

#include "sholat.h"
#include "sholathelper.h"
#include "timehelper.h"
#include "locationhelper.h"

#include <pgmspace.h>
#include "asyncserver.h"
// #include "buzzer.h"
// #include "mqtt.h"
#include "asyncpinghelper.h"

#if defined(ARDUINO) && ARDUINO >= 100
#include "Arduino.h"
#else
#include "WProgram.h"
#endif

#include "PingAlive.h"

#define PRINTPORT Serial
#define DEBUGPORT Serial

// #define RELEASE

#define PRINT(fmt, ...)                      \
  {                                          \
    static const char pfmt[] PROGMEM = fmt;  \
    PRINTPORT.printf_P(pfmt, ##__VA_ARGS__); \
  }

#ifndef RELEASE
#define DEBUGLOG(fmt, ...)                   \
  {                                          \
    static const char pfmt[] PROGMEM = fmt;  \
    DEBUGPORT.printf_P(pfmt, ##__VA_ARGS__); \
  }
#else
#define DEBUGLOG(...)
#endif

#define AP_ENABLE_BUTTON 4 // Button pin to enable AP during startup for configuration. -1 to disable

strConfig _config;
strApConfig _configAP; // Static AP config settings
strHTTPAuth _httpAuth;

Ticker _secondTk;
Ticker restartESP;

//FS* _fs;
unsigned long wifiDisconnectedSince = 0;
String _browserMD5 = "";
uint32_t _updateSize = 0;

uint32_t timestampReceivedFromWebGUI = 0;

bool autoConnect = true;
bool autoReconnect = true;

bool eventsourceTriggered = false;
bool wsConnected = false;
bool configFileNetworkUpdatedFlag = false;
bool configFileLocationUpdated = false;
bool configFileTimeUpdated = false;

WiFiEventHandler onStationModeConnectedHandler, onStationModeGotIPHandler, onStationModeDisconnectedHandler;
WiFiEventHandler stationConnectedHandler;
WiFiEventHandler stationDisconnectedHandler;
WiFiEventHandler probeRequestPrintHandler;
WiFiEventHandler probeRequestBlinkHandler;

bool wifiGotIpFlag = false;
bool wifiDisconnectedFlag = false;
bool stationConnectedFlag = false;
bool stationDisconnectedFlag = false;

bool firmwareUpdated = false;

// SKETCH BEGIN

FSInfo fs_info;

DNSServer dnsServer;

AsyncWebServer server(80);
AsyncWebSocket ws("/ws");
AsyncEventSource events("/events");
uint32_t clientID;

bool sendFreeHeapStatusFlag = false;
bool sendDateTimeFlag = false;
bool setDateTimeFromGUIFlag = false;

void onWsEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len)
{
  if (type == WS_EVT_CONNECT)
  {
    //client connected
    clientID = client->id();
    DEBUGLOG("ws[%s][%u] connect\r\n", server->url(), client->id());
    client->printf("Hello Client %u :)", client->id());
    client->ping();
  }
  else if (type == WS_EVT_DISCONNECT)
  {
    //client disconnected
    DEBUGLOG("ws[%s][%u] disconnect: [%u]\r\n", server->url(), client->id(), client->id());
  }
  else if (type == WS_EVT_ERROR)
  {
    //error was received from the other end
    DEBUGLOG("ws[%s][%u] error(%u): %s\r\n", server->url(), client->id(), *((uint16_t *)arg), (char *)data);
  }
  else if (type == WS_EVT_PONG)
  {
    //pong message was received (in response to a ping request maybe)
    DEBUGLOG("ws[%s][%u] pong[%u]: %s\r\n", server->url(), client->id(), len, (len) ? (char *)data : "");
  }
  else if (type == WS_EVT_DATA)
  {
    //data packet
    AwsFrameInfo *info = (AwsFrameInfo *)arg;

    // char msg[len + 1];

    if (info->final && info->index == 0 && info->len == len)
    {
      //the whole message is in a single frame and we got all of it's data
      DEBUGLOG("ws[%s][%u] %s-message[%u]: ", server->url(), client->id(), (info->opcode == WS_TEXT) ? "text" : "binary", (uint32_t)info->len);
      if (info->opcode == WS_TEXT)
      {
        data[len] = 0;
        // os_printf("%s\n", (char *)data);
        DEBUGLOG("%s\n", (char *)data);
      }
      else
      {
        for (size_t i = 0; i < info->len; i++)
        {
          // os_printf("%02x ", data[i]);
          DEBUGLOG("%02x ", data[i]);
        }
        // os_printf("\n");
        DEBUGLOG("\n");
      }
      if (info->opcode == WS_TEXT)
      {
        // client->text("I got your text message");
      }
      else
      {
        // client->binary("I got your binary message");
      }
    }
    else
    {
      //message is comprised of multiple frames or the frame is split into multiple packets
      if (info->index == 0)
      {
        if (info->num == 0)
          DEBUGLOG("ws[%s][%u] %s-message start\r\n", server->url(), client->id(), (info->message_opcode == WS_TEXT) ? "text" : "binary");
        DEBUGLOG("ws[%s][%u] frame[%u] start[%llu]\r\n", server->url(), client->id(), info->num, info->len);
      }

      DEBUGLOG("ws[%s][%u] frame[%u] %s[%llu - %llu]: ", server->url(), client->id(), info->num, (info->message_opcode == WS_TEXT) ? "text" : "binary", info->index, info->index + len);
      if (info->message_opcode == WS_TEXT)
      {
        data[len] = 0;
        DEBUGLOG("%s\n", (char *)data);
      }
      else
      {
        for (size_t i = 0; i < len; i++)
        {
          DEBUGLOG("%02x ", data[i]);
        }
        DEBUGLOG("\n");
      }

      if ((info->index + len) == info->len)
      {
        DEBUGLOG("ws[%s][%u] frame[%u] end[%llu]\r\n", server->url(), client->id(), info->num, info->len);
        if (info->final)
        {
          DEBUGLOG("ws[%s][%u] %s-message end\r\n", server->url(), client->id(), (info->message_opcode == WS_TEXT) ? "text" : "binary");
          if (info->message_opcode == WS_TEXT)
          {
            // client->text("I got your text message");
          }
          else
          {
            // client->binary("I got your binary message");
          }
        }
      }
    }

    if (strncmp_P((char *)data, pgm_schedulepagesholat, strlen_P(pgm_schedulepagesholat)) == 0)
    {
      // clientVisitSholatTimePage = true;
      sendSholatSchedule(2);
    }
    else if (strncmp_P((char *)data, pgm_settimepage, strlen_P(pgm_settimepage)) == 0)
    {
      sendDateTimeFlag = true;
    }
    else if (strncmp_P((char *)data, pgm_freeheap, strlen_P(pgm_freeheap)) == 0)
    {
      sendFreeHeapStatusFlag = true;
    }
    else if (strncmp((char *)data, "/status/datetime", strlen("/status/datetime")) == 0)
    {
      sendDateTimeFlag = true;
    }
    else if (data[0] == '{')
    {
      StaticJsonDocument<1024> root;
      DeserializationError error = deserializeJson(root, data);

      if (error)
      {
        return;
      }

      //******************************
      // handle SAVE CONFIG (not fast)
      //******************************

      if (root.containsKey(FPSTR(pgm_saveconfig)))
      {
        const char *saveconfig = root[FPSTR(pgm_saveconfig)];

        //remove json key before saving
        root.remove(FPSTR(pgm_saveconfig));

        if (false)
        {
        }
        //******************************
        // save TIME config
        //******************************
        else if (strcmp_P(saveconfig, pgm_configpagetime) == 0)
        {
          File file = SPIFFS.open(FPSTR(pgm_configfiletime), "w");

          if (!file)
          {
            DEBUGLOG("Failed to open TIME config file\r\n");
            file.close();
            return;
          }

