minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
  //json["led"] = config.connectionLed;

  //TODO add AP data to html
  File file = SPIFFS.open(FPSTR(pgm_configfiletime), "w");

#ifndef RELEASEASYNCWS
  serializeJsonPretty(json, DEBUGPORT);
  DEBUGLOG("\r\n");
#endif

  serializeJsonPretty(json, file);
  file.flush();
  file.close();
  return true;
}

//*************************
// SAVE SHOLAT CONFIG
//*************************
bool save_config_sholat()
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonDocument<1024> root;

  //root[FPSTR(pgm_location)] = _sholatConfig.location;
  //root[FPSTR(pgm_timezone)] = _sholatConfig.timezone;
  //root[FPSTR(pgm_latitude)] = _sholatConfig.latitude;
  //root[FPSTR(pgm_longitude)] = _sholatConfig.longitude;

  // calcMethod
  if (_sholatConfig.calcMethod == Jafari)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Jafari);
  }
  else if (_sholatConfig.calcMethod == Karachi)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Karachi);
  }
  else if (_sholatConfig.calcMethod == ISNA)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_ISNA);
  }
  else if (_sholatConfig.calcMethod == MWL)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_MWL);
  }
  else if (_sholatConfig.calcMethod == Makkah)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Makkah);
  }
  else if (_sholatConfig.calcMethod == Egypt)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Egypt);
  }
  else if (_sholatConfig.calcMethod == Custom)
  {
    root[FPSTR(pgm_calcMethod)] = FPSTR(pgm_Custom);
  }

  //asrJuristic
  if (_sholatConfig.asrJuristic == Shafii)
  {
    root[FPSTR(pgm_asrJuristic)] = FPSTR(pgm_Shafii);
  }
  else if (_sholatConfig.asrJuristic == Hanafi)
  {
    root[FPSTR(pgm_asrJuristic)] = FPSTR(pgm_Hanafi);
  }

  // highLatsAdjustMethod
  if (_sholatConfig.highLatsAdjustMethod == None)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_None);
  }
  else if (_sholatConfig.highLatsAdjustMethod == MidNight)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_MidNight);
  }
  else if (_sholatConfig.highLatsAdjustMethod == OneSeventh)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_OneSeventh);
  }
  else if (_sholatConfig.highLatsAdjustMethod == AngleBased)
  {
    root[FPSTR(pgm_highLatsAdjustMethod)] = FPSTR(pgm_AngleBased);
  }

  root[FPSTR(pgm_fajrAngle)] = _sholatConfig.fajrAngle;
  root[FPSTR(pgm_maghribAngle)] = _sholatConfig.maghribAngle;
  root[FPSTR(pgm_ishaAngle)] = _sholatConfig.ishaAngle;
  root[FPSTR(pgm_offsetImsak)] = _sholatConfig.offsetImsak;
  root[FPSTR(pgm_offsetFajr)] = _sholatConfig.offsetFajr;
  root[FPSTR(pgm_offsetSunrise)] = _sholatConfig.offsetSunrise;
  root[FPSTR(pgm_offsetDhuhr)] = _sholatConfig.offsetDhuhr;
  root[FPSTR(pgm_offsetAsr)] = _sholatConfig.offsetAsr;
  root[FPSTR(pgm_offsetSunset)] = _sholatConfig.offsetSunset;
  root[FPSTR(pgm_offsetMaghrib)] = _sholatConfig.offsetMaghrib;
  root[FPSTR(pgm_offsetIsha)] = _sholatConfig.offsetIsha;

#ifndef RELEASEASYNCWS
  serializeJsonPretty(root, DEBUGPORT);
  DEBUGLOG("\r\n");
#endif

  File file = SPIFFS.open(FPSTR(pgm_configfilesholat), "w");
  serializeJsonPretty(root, file);
  file.flush();
  file.close();
  return true;
}

//*************************
// SAVE CONFIG LEDMATRIX
//*************************
bool save_config_ledmatrix()
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  StaticJsonDocument<1024> root;

  uint8_t opmode = 0;

  if (_ledMatrixSettings.operatingmode == Normal)
  {
    opmode = 0;
  }
  else if (_ledMatrixSettings.operatingmode == Config)
  {
    opmode = 1;
  }
  else if (_ledMatrixSettings.operatingmode == Edit)
  {
    opmode = 2;
  }

  root[FPSTR(pgm_operatingmode)] = opmode;

  if (_ledMatrixSettings.pagemode == Automatic)
  {
    root[FPSTR(pgm_pagemode)] = FPSTR(pgm_automatic);
  }
  else if (_ledMatrixSettings.pagemode == Manual)
  {
    root[FPSTR(pgm_pagemode)] = FPSTR(pgm_manual);
  }

  root[FPSTR(pgm_pagemode0)] = _ledMatrixSettings.pagemode0;
  root[FPSTR(pgm_pagemode1)] = _ledMatrixSettings.pagemode1;
  root[FPSTR(pgm_pagemode2)] = _ledMatrixSettings.pagemode2;
  root[FPSTR(pgm_scrollrow_0)] = _ledMatrixSettings.scrollrow_0;
  root[FPSTR(pgm_scrollrow_1)] = _ledMatrixSettings.scrollrow_1;
  root[FPSTR(pgm_scrollspeed)] = _ledMatrixSettings.scrollspeed;
  root[FPSTR(pgm_brightness)] = _ledMatrixSettings.brightness;
  root[FPSTR(pgm_adzanwaittime)] = _ledMatrixSettings.adzanwaittime;
  root[FPSTR(pgm_iqamahwaittime)] = _ledMatrixSettings.iqamahwaittime;

#ifndef RELEASEASYNCWS
  serializeJsonPretty(root, DEBUGPORT);
  DEBUGLOG("\r\n");
#endif

  File file = SPIFFS.open(FPSTR(pgm_configfileledmatrix), "w");
  serializeJsonPretty(root, file);
  file.flush();
  file.close();
  return true;
}

void load_running_text()
{
  // DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  const char *fileName = pgm_RUNNING_TEXT_FILE;

  File file = SPIFFS.open(fileName, "r");
  if (!file)
  {
    DEBUGLOG("Failed to open %s file\r\n", fileName);
    //return F("failed");
    //    return false;
    file.close();
    return;
  }

  // this is going to get the number of bytes in the file and give us the value in an integer
  size_t size = file.size();
  //Serial.println(size);
  //int chunkSize=1;
  int chunkSize = 512;
  //This is a character array to store a chunk of the file.
  //We'll store 1024 characters at a time
  // char contents[fileSize];
  // char buf[chunkSize];

  char buf[matrix.width() + 1];
  // int numberOfChunks = (size / chunkSize) + 1;

  // int count = 0;
  // int remainingChunks = size;

  int16_t x1Temp, y1Temp;
  uint16_t wTemp, hTemp;

  uint16_t wFirstChar;

  wText = 0;

  static uint16_t startPos = 0;
  static uint16_t endPos = 0;

  static int offset = 0;

  // calculate widht of first char
  while (file.available())
  {
    char c = file.read();
    buf[file.position() - 1] = c;
    buf[file.position()] = '\0';
    matrix.getTextBounds(buf, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
    if (wTemp > matrix.width())
    {
      // startPos = file.position();
      endPos = file.position();
      break;
    }
  }

  char temp[2];
  temp[0] = buf[0];
  temp[1] = '\0';
  matrix.getTextBounds(temp, 0, 0, &x1Temp, &y1Temp, &wFirstChar, &hTemp);

  offset = -1;
  // int i = -1;

  // file.seek(0, SeekSet);
  // startPos = file.position();

  // while (file.available())
  // {
  //   offset++;
  //   file.seek(offset, SeekSet);
  //   char temp[2];
  //   file.read((uint8_t *)temp, 1);
  //   temp[1] = '\0';

  //   buf[offset] = temp[0];
  //   buf[offset + 1] = '\0';

  //   matrix.getTextBounds(buf, 0, 0, &x1Temp, &y1Temp, &wTemp, &hTemp);
  //   if (wTemp > matrix.width())
  //   {
  //     break;
  //   }
  // }

