minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
void sendDateTime(uint8_t mode)
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  // DynamicJsonDocument root(2048);
  StaticJsonDocument<1024> root;

  RtcDateTime dt;
  dt.InitWithEpoch32Time(localTime);

  root["d"] = dt.Day();
  root["m"] = dt.Month();
  root["y"] = dt.Year();
  root["hr"] = dt.Hour();
  root["min"] = dt.Minute();
  root["sec"] = dt.Second();
  // root["tz"] = TimezoneFloat();
  root["tzStr"] = _configLocation.timezonestring;
  root["utc"] = now;
  root["local"] = localTime;

  root[FPSTR(pgm_date)] = getDateStr(localTime);
  root[FPSTR(pgm_time)] = getTimeStr(localTime);
  root[FPSTR(pgm_uptime)] = getUptimeStr();
  root[FPSTR(pgm_lastboot)] = getLastBootStr();
  root[FPSTR(pgm_internetstatus)] = FPSTR(internetstatus_P[internet]);
  root[FPSTR(pgm_rtcstatus)] = FPSTR(rtcstatus_P[GetRtcStatus()]);

  if (syncByRtcFlag)
  {
    root[FPSTR(pgm_lastsyncby)] = FPSTR(pgm_RTC);
  }
  else if (syncByNtpFlag)
  {
    root[FPSTR(pgm_lastsyncby)] = FPSTR(pgm_NTP);
  }
  else
  {
    root[FPSTR(pgm_lastsyncby)] = FPSTR(pgm_None);
  }

  root[FPSTR(pgm_nextsync)] = getNextSyncStr();

  if (lastSyncByNtp)
  {
    char temp[64];
    strlcpy(temp, getLastSyncStr(lastSyncByNtp), sizeof(temp) / sizeof(temp[0]));
    root[FPSTR(pgm_lastsyncbyntp)] = temp;
  }
  else
  {
    root[FPSTR(pgm_lastsyncbyntp)] = FPSTR(pgm_never);
  }

  if (lastSyncByRtc)
  {
    root[FPSTR(pgm_lastsyncbyrtc)] = getLastSyncStr(lastSyncByRtc);
  }
  else
  {
    root[FPSTR(pgm_lastsyncbyrtc)] = FPSTR(pgm_never);
  }

  root["ping_seq_num_send"] = ping_seq_num_send;
  root["ping_seq_num_recv"] = ping_seq_num_recv;

  size_t len = measureJson(root);
  char buf[len + 1];
  serializeJson(root, buf, len + 1);

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf);
    // events.send(buf, "timeDate", millis());
  }
  else if (mode == 2)
  {
    if (ws.hasClient(clientID))
    {
      ws.text(clientID, buf);
    }
    else
    {
      DEBUGLOG("ClientID %d is no longer available.\r\n", clientID);
    }
  }
}

void sendHeap(uint8_t mode)
{
  DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

  uint32_t heap = ESP.getFreeHeap();

  StaticJsonDocument<256> root;
  root["heap"] = heap;

  size_t len = measureJson(root);
  char buf[len + 1];
  serializeJson(root, buf, len + 1);

  if (mode == 0)
  {
    //
  }
  else if (mode == 1)
  {
    events.send(buf, "heap");
  }
  else if (mode == 2)
  {
    if (ws.hasClient(clientID))
    {
      ws.text(clientID, buf);
    }
    else
    {
      DEBUGLOG("ClientID %d is no longer available.\r\n", clientID);
    }
  }
}

int pgm_lastIndexOf(uint8_t c, const char *p)
{
  int last_index = -1; // -1 indicates no match
  uint8_t b;
  for (int i = 0; true; i++)
  {
    b = pgm_read_byte(p++);
    if (b == c)
      last_index = i;
    else if (b == 0)
      break;
  }
  return last_index;
}

// displays at startup the Sketch running in the Arduino
void display_srcfile_details(void)
{
  const char *the_path = PSTR(__FILE__); // save RAM, use flash to hold __FILE__ instead

  int slash_loc = pgm_lastIndexOf('/', the_path); // index of last '/'
  if (slash_loc < 0)
    slash_loc = pgm_lastIndexOf('\\', the_path); // or last '\' (windows, ugh)

  int dot_loc = pgm_lastIndexOf('.', the_path); // index of last '.'
  if (dot_loc < 0)
    dot_loc = pgm_lastIndexOf(0, the_path); // if no dot, return end of string

  DEBUGLOG("\r\nSketch name: ");

  for (int i = slash_loc + 1; i < dot_loc; i++)
  {
    uint8_t b = pgm_read_byte(&the_path[i]);
    if (b != 0)
    {
      DEBUGLOG("%c", (char)b);
    }

    else
      break;
  }
  DEBUGLOG("\r\n");

  DEBUGLOG("Compiled on: ");
  DEBUGLOG(__DATE__);
  DEBUGLOG(" at ");
  DEBUGLOG(__TIME__);
  DEBUGLOG("\r\n\r\n");
}

bool save_system_info()
{
  PRINT("%s\r\n", __PRETTY_FUNCTION__);

  // const char* pathtofile = PSTR(pgm_filesystemoverview);

  // String fileName = FPSTR(pgm_systeminfofile);

  size_t fileLen = strlen_P(pgm_systeminfofile);
  char fileName[fileLen + 1];
  strcpy_P(fileName, pgm_systeminfofile);

  File file;
  if (!SPIFFS.exists(fileName))
  {
    file = SPIFFS.open(fileName, "w");
    if (!file)
    {
      PRINT("Failed to open %s file for writing\r\n", fileName);
      file.close();
      return false;
    }
    //create blank json file
    PRINT("Creating %s file for writing\r\n", fileName);
    file.print("{}");
    file.close();
  }
  //get existing json file
  file = SPIFFS.open(fileName, "w");
  if (!file)
  {
    PRINT("Failed to open %s file", fileName);
    return false;
  }

  const char *the_path = PSTR(__FILE__);
  // const char *_compiletime = PSTR(__TIME__);

  int slash_loc = pgm_lastIndexOf('/', the_path); // index of last '/'
  if (slash_loc < 0)
    slash_loc = pgm_lastIndexOf('\\', the_path); // or last '\' (windows, ugh)

  int dot_loc = pgm_lastIndexOf('.', the_path); // index of last '.'
  if (dot_loc < 0)
    dot_loc = pgm_lastIndexOf(0, the_path); // if no dot, return end of string

  int lenPath = strlen(the_path);
  int lenStrFileName;

  bool useFullPath = true;
  int start_loc = 0;

  if (useFullPath)
  {
    lenStrFileName = lenPath;
    start_loc = 0;
  }
  else
  {
    lenStrFileName = (lenPath - (slash_loc + 1));
    start_loc = slash_loc + 1;
  }

  char strFileName[lenStrFileName + 1];

  //Serial.println(lenFileName);
  //Serial.println(sizeof(fileName));

  int j = 0;
  for (int i = start_loc; i < lenPath; i++)
  {
    uint8_t b = pgm_read_byte(&the_path[i]);
    if (b != 0)
    {
      strFileName[j] = (char)b;
      //Serial.print(strFileName[j]);
      j++;
      if (j >= lenStrFileName)
      {
        break;
      }
    }
    else
    {
      break;
    }
  }
  //Serial.println();
  //Serial.println(j);
  strFileName[lenStrFileName] = '\0';

  //const char* _compiledate = PSTR(__DATE__);
  int lenCompileDate = strlen_P(PSTR(__DATE__));
  char compileDate[lenCompileDate + 1];
  strcpy_P(compileDate, PSTR(__DATE__));

  int lenCompileTime = strlen_P(PSTR(__TIME__));
  char compileTime[lenCompileTime + 1];
  strcpy_P(compileTime, PSTR(__TIME__));

