minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
  // WiFi.persistent(true);
  // WiFi.mode(WIFI_OFF);

  DEBUGLOG("WiFi.getListenInterval(): %d\r\n", WiFi.getListenInterval());
  DEBUGLOG("WiFi.isSleepLevelMax(): %d\r\n", WiFi.isSleepLevelMax());

  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  // WiFi.setSleepMode(WIFI_LIGHT_SLEEP);
  // WiFi.setSleepMode(WIFI_MODEM_SLEEP);

  DEBUGLOG("WiFi.getListenInterval(): %d\r\n", WiFi.getListenInterval());
  DEBUGLOG("WiFi.isSleepLevelMax(): %d\r\n", WiFi.isSleepLevelMax());

  // WiFi.mode(WIFI_OFF); //=========== TESTING, ORIGINAL-NYA WIFI DIMATIKAN DULU

  // Set wifi mode

  int wifiMode = WIFI_AP;

  if (strcmp(_config.mode, "STA") == 0)
    wifiMode = WIFI_STA;
  else if (strcmp(_config.mode, "AP_STA") == 0)
    wifiMode = WIFI_AP_STA;
  else
    wifiMode = WIFI_AP;

  if (wifiMode == WIFI_AP)
  {
    DEBUGLOG("Start Wifi in AP mode.\r\n\r\n");
    WiFi.mode(WIFI_AP);
    WiFi.softAP(_config.hostname, NULL);
  }
  else if (wifiMode == WIFI_STA)
  {
    DEBUGLOG("Start Wifi in STA mode.\r\n\r\n");

    // WiFi.onEvent(onWifiGotIP, WiFiEvent_t::SYSTEM_EVENT_STA_GOT_IP);
    // WiFi.onEvent(onWifiGotIP, WiFiEvent_t::SYSTEM_EVENT_STA_GOT_IP);

    WiFi.mode(WIFI_STA);
    WiFi.hostname(_config.hostname);
    WiFi.begin(_config.ssid, _config.password);
    if (WiFi.waitForConnectResult() != WL_CONNECTED)
    {
      DEBUGLOG("STA: Failed!\r\n\r\n");
      WiFi.disconnect(false);
      delay(1000);
      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
    }
  }
  else if (wifiMode == WIFI_AP_STA)
  {
    DEBUGLOG("Start Wifi in AP_STA mode.\r\n\r\n");
    WiFi.mode(WIFI_AP_STA);
    WiFi.softAP(_config.hostname, NULL);
    WiFi.hostname(_config.hostname);
    WiFi.begin(_config.ssid, _config.password);
    if (WiFi.waitForConnectResult() != WL_CONNECTED)
    {
      DEBUGLOG("STA: Failed!\r\n\r\n");
      WiFi.disconnect(false);
      delay(1000);
      WiFi.hostname(_config.hostname);
      WiFi.begin(_config.ssid, _config.password);
    }
  }

  // dnsServer.start(53, "*", WiFi.softAPIP());

  DEBUGLOG("Starting mDNS responder...\r\n");
  // if (!MDNS.begin(_config.hostname))
  if (!MDNS.begin(_config.hostname))
  { // Start the mDNS responder for esp8266.local
    DEBUGLOG("Error setting up mDNS responder!\r\n");
  }
  else
  {
    DEBUGLOG("mDNS responder started\r\n");
    MDNS.addService("http", "tcp", 80);
  }

  //Send OTA events to the browser
  ArduinoOTA.onStart([]() { events.send("Update Start", "ota"); });
  ArduinoOTA.onEnd([]() { events.send("Update End", "ota"); });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    char p[32];
    sprintf(p, "Progress: %u%%\n", (progress / (total / 100)));
    events.send(p, "ota");
  });
  ArduinoOTA.onError([](ota_error_t error) {
    if (error == OTA_AUTH_ERROR)
      events.send("Auth Failed", "ota");
    else if (error == OTA_BEGIN_ERROR)
      events.send("Begin Failed", "ota");
    else if (error == OTA_CONNECT_ERROR)
      events.send("Connect Failed", "ota");
    else if (error == OTA_RECEIVE_ERROR)
      events.send("Recieve Failed", "ota");
    else if (error == OTA_END_ERROR)
      events.send("End Failed", "ota");
  });
  ArduinoOTA.setHostname(_config.hostname);
  ArduinoOTA.begin();

  if (WiFi.getMode() == WIFI_STA)
  {
    NBNS.begin(_config.hostname);

    if (1)
    {
      DEBUGLOG("Starting SSDP...\r\n");
      SSDP.setSchemaURL("description.xml");
      SSDP.setHTTPPort(80);
      SSDP.setDeviceType("upnp:rootdevice");
      // SSDP.setModelName(ssdp_modelName);
      // SSDP.setModelNumber(ssdp_modelNumber);

      // SSDP.setSchemaURL(FPSTR(pgm_descriptionxml));
      // SSDP.setHTTPPort(80);
      // SSDP.setDeviceType(FPSTR(pgm_upnprootdevice));
      //  SSDP.setModelName(_config.deviceName.c_str());
      //  SSDP.setModelNumber(FPSTR(modelNumber));
      SSDP.begin();

      server.on("/description.xml", HTTP_GET, [](AsyncWebServerRequest *request) {
        DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

        File file = SPIFFS.open(FPSTR(pgm_descriptionxmlfile), "r");
        if (!file)
        {
          PRINT("Failed to open %s file\r\n", file.name());
          file.close();
          return;
        }

        size_t size = file.size();
        DEBUGLOG("%s file size: %d bytes\r\n", file.name(), size);

        // size_t allocatedSize = 1024;
        // if (size > allocatedSize)
        // {
        //   PRINT("WARNING, %s file size %d bytes is larger than allocatedSize %d bytes. Exiting...\r\n", file.name(), size, allocatedSize);
        //   file.close();
        //   return;
        // }

        // Allocate a buffer to store contents of the file
        char buf[size + 1];

        //copy file to buffer
        file.readBytes(buf, size);

        //add termination character at the end
        buf[size] = '\0';

        //close the file, save your memory, keep healthy :-)
        file.close();

        // DEBUGLOG("%s\r\n", buf);

        size_t lenBuf = size;
        DEBUGLOG("Template size: %d bytes\r\n", lenBuf);

        //convert IP address to char array
        size_t len = strlen(WiFi.localIP().toString().c_str());
        char URLBase[len + 1];
        strlcpy(URLBase, WiFi.localIP().toString().c_str(), sizeof(URLBase));

        lenBuf = lenBuf + strlen(URLBase);

        // const char *friendlyName = WiFi.hostname().toString().c_str();
        len = strlen(WiFi.hostname().c_str());
        char friendlyName[len + 1];
        strlcpy(friendlyName, WiFi.hostname().c_str(), sizeof(friendlyName));

        lenBuf = lenBuf + strlen(friendlyName);

        char presentationURL[] = "/";

        lenBuf = lenBuf + strlen(presentationURL);

        uint32_t serialNumber = ESP.getChipId();

        char bufChipId[23];
        snprintf(bufChipId, sizeof(bufChipId) / sizeof(bufChipId[0]), "%06X", ESP.getChipId());

        lenBuf = lenBuf + strlen(friendlyName);

        char modelName[] = "ESP8266EX";

        lenBuf = lenBuf + strlen(modelName);
        const char *modelNumber = friendlyName;

