minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
            serializeJsonPretty(root, file);
            file.flush();
            file.close();

            configFileLocationUpdated = true;

            //beep
            tone1 = HIGH;
          }
        }
        else
        {
          DEBUGLOG("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        }
      }
    }
    else
    {
      // _httpAuth.auth = false;
    }

    // request->send(SPIFFS, request->url());
    request->send(SPIFFS, FPSTR(pgm_configpagelocation));
  });

  server.on("/config/time", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    send_config_time(request);
  });

  server.on("/config/sholat", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    send_config_sholat(request);
  });

  server.on("/config/ledmatrix", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    send_config_ledmatrix(request);
  });

  server.on("/configledmatrix", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    //List all parameters
    int params = request->params();
    if (params)
    {
      for (int i = 0; i < params; i++)
      {
        AsyncWebParameter *p = request->getParam(i);
        if (p->isFile())
        { //p->isPost() is also true
          DEBUGLOG("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
        }
        else if (p->isPost())
        {
          DEBUGLOG("POST [%s]: %s\r\n", p->name().c_str(), p->value().c_str());

          if (request->hasParam(FPSTR(pgm_saveconfig), true))
          {
            const char *config = p->value().c_str();

            StaticJsonDocument<512> root;
            DeserializationError error = deserializeJson(root, config);

            File file = SPIFFS.open(FPSTR(pgm_configfileledmatrix), "w");

            if (!file || error)
            {
              DEBUGLOG("Failed to open LED MATRIX config file\r\n");
              file.close();
              return;
            }

            serializeJsonPretty(root, file);
            file.flush();
            file.close();

            load_config_ledmatrix();

            //beep
            tone1 = HIGH;
          }

          if (request->hasParam(FPSTR(pgm_longtext), true))
          {
            const char *fileName = pgm_RUNNING_TEXT_FILE;

            File file = SPIFFS.open(fileName, "w");

            if (!file)
            {
              DEBUGLOG("Failed to open %s file\r\n", fileName);
              file.close();
              return;
            }

            const char *longtext = p->value().c_str();

            for (uint16_t j = 0; j < strlen(longtext); j++)
            {
              file.write(longtext[j]);
            }

            file.close();
            tone1 = HIGH;
          }
        }
        else
        {
          DEBUGLOG("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        }
      }
    }
    else
    {
      // _httpAuth.auth = false;
    }

    // request->send(SPIFFS, request->url());
    request->send(SPIFFS, FPSTR(pgm_configpageledmatrix));
  });

  server.on("/config/mqtt", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());
    send_config_mqtt(request);
  });

  server.on("/configmqtt", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    //List all parameters
    int params = request->params();
    if (params)
    {
      for (int i = 0; i < params; i++)
      {
        AsyncWebParameter *p = request->getParam(i);
        if (p->isFile())
        { //p->isPost() is also true
          DEBUGLOG("FILE[%s]: %s, size: %u\r\n", p->name().c_str(), p->value().c_str(), p->size());
        }
        else if (p->isPost())
        {
          DEBUGLOG("POST [%s]: %s\r\n", p->name().c_str(), p->value().c_str());

          //******************************
          // save Mqtt config
          //******************************
          if (request->hasParam(FPSTR(pgm_configpagemqtt), true))
          {
            const char *config = p->value().c_str();

            StaticJsonDocument<512> root;
            DeserializationError error = deserializeJson(root, config);

            File file = SPIFFS.open(FPSTR(pgm_configfilemqtt), "w");

            if (!file || error)
            {
              DEBUGLOG("Failed to open MQTT config file\r\n");
              file.close();
              return;
            }

            serializeJsonPretty(root, file);
            file.flush();
            file.close();

            load_config_mqtt();

            // configFileNetworkUpdatedFlag = true;

            //beep
            tone1 = HIGH;
          }

          //******************************
          // save MqttPubSub config
          //******************************
          if (request->hasParam(FPSTR(pgm_configpagemqttpubsub), true))
          {
            const char *config = p->value().c_str();

            StaticJsonDocument<512> root;
            DeserializationError error = deserializeJson(root, config);

            File file = SPIFFS.open(FPSTR(pgm_configfilemqttpubsub), "w");

            if (!file || error)
            {
              DEBUGLOG("Failed to open MQTT PUBSUB config file\r\n");
              file.close();
              return;
            }

            serializeJsonPretty(root, file);
            file.flush();
            file.close();

            //beep
            tone1 = HIGH;
          }
        }
        else
        {
          DEBUGLOG("GET[%s]: %s\r\n", p->name().c_str(), p->value().c_str());
        }
      }
    }
    else
    {
      // _httpAuth.auth = false;
    }

    // request->send(SPIFFS, request->url());
    request->send(SPIFFS, FPSTR(pgm_configpagemqtt));
  });

  server.on("/status/sholatschedule", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", __PRETTY_FUNCTION__);

    AsyncResponseStream *response = request->beginResponseStream("application/json");
    // DynamicJsonDocument root(2048);
    StaticJsonDocument<1024> root;

    root[FPSTR(pgm_type)] = FPSTR(pgm_sholatdynamic);
    root[FPSTR(pgm_h)] = HOUR;
    root[FPSTR(pgm_m)] = MINUTE;
    root[FPSTR(pgm_s)] = SECOND;
    root[FPSTR(pgm_curr)] = sholatNameStr(CURRENTTIMEID);
    root[FPSTR(pgm_next)] = sholatNameStr(NEXTTIMEID);

