minida28/SHOLAT_ESP8266_LEDMATRIX_NO_WS/src/asyncserver.cpp
    root[FPSTR(pgm_loc)] = _configLocation.district;
    //  root[FPSTR(pgm_day)] = dayNameStr(weekday(local_time()));
    //  root[FPSTR(pgm_date)] = getDateStr(local_time());
    root[FPSTR(pgm_fajr)] = sholatTimeArray[0];
    root[FPSTR(pgm_syuruq)] = sholatTimeArray[1];
    root[FPSTR(pgm_dhuhr)] = sholatTimeArray[2];
    root[FPSTR(pgm_ashr)] = sholatTimeArray[3];
    root[FPSTR(pgm_maghrib)] = sholatTimeArray[5];
    root[FPSTR(pgm_isya)] = sholatTimeArray[6];

    serializeJson(root, *response);
    request->send(response);
  });

  server.on("/status/sholatschedule2", [](AsyncWebServerRequest *request) {
    AsyncResponseStream *response = request->beginResponseStream("application/json");
    // DynamicJsonDocument doc(2048);
    StaticJsonDocument<1024> doc;

    // JsonArray root = doc.to<JsonArray>();

    JsonObject root = doc.to<JsonObject>();
    root[FPSTR(pgm_loc)] = _configLocation.district;
    root[FPSTR(pgm_curr)] = sholatNameStr(CURRENTTIMEID);
    root[FPSTR(pgm_next)] = sholatNameStr(NEXTTIMEID);
    root[FPSTR(pgm_timestamp)] = sholat.timestampSholatTimesToday[NEXTTIMEID];

    // JsonObject sholattime = root.createNestedObject("sholattime");
    // weather["temp"] = 14.2;
    // weather["cond"] = "cloudy";

    // JsonArray coords = root.createNestedArray(sholatNameStr(i));
    JsonArray coords = root.createNestedArray("sholattimes");
    // JsonObject sholat2 = root.createNestedObject();

    for (int i = 0; i < TimesCount; ++i)
    {
      JsonObject sholat2 = coords.createNestedObject();

      // JsonArray coord = sholat2.createNestedArray(sholatNameStr(i));
      // coord.add(sholat.times[i]);
      // coord.add(sholatTimeArray[i]);
      // coord.add(sholat.timestampSholatTimesToday[i]);

      sholat2["name"] = sholatNameStr(i);
      sholat2["float"] = sholat.times[i];
      sholat2["char"] = sholatTimeArray[i];
      sholat2[FPSTR(pgm_timestamp)] = sholat.timestampSholatTimesToday[i];
    }

    serializeJson(doc, *response);
    request->send(response);
  });

  server.on("/status/network", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    AsyncResponseStream *response = request->beginResponseStream("application/json");
    StaticJsonDocument<1024> root;

    char bufChipId[23];
    snprintf(bufChipId, sizeof(bufChipId) / sizeof(bufChipId[0]), "%06X", ESP.getChipId());

    root[FPSTR(pgm_chipid)] = bufChipId;
    root[FPSTR(pgm_hostname)] = WiFi.hostname();

    int wifiStatus = WiFi.status();

    if (wifiStatus <= 6)
      root[FPSTR(pgm_status)] = FPSTR(wifistatus_P[wifiStatus]);
    else
      root[FPSTR(pgm_status)] = FPSTR(WL_NO_SHIELD_Str);

    int wifiMode = WiFi.getMode();

    if (wifiMode <= 3)
      root[FPSTR(pgm_mode)] = FPSTR(wifimode_P[wifiMode]);
    else
      root[FPSTR(pgm_mode)] = FPSTR(MODE_MAX_Str);

    const char *phymodes[] = {"", "B", "G", "N"};
    root[FPSTR(pgm_phymode)] = phymodes[WiFi.getPhyMode()];
    root[FPSTR(pgm_channel)] = WiFi.channel();
    root[FPSTR(pgm_ssid)] = WiFi.SSID();
    root[FPSTR(pgm_password)] = WiFi.psk();
    root[FPSTR(pgm_encryption)] = WiFi.encryptionType(0);
    root[FPSTR(pgm_isconnected)] = WiFi.isConnected();
    root[FPSTR(pgm_autoconnect)] = WiFi.getAutoConnect();
    root[FPSTR(pgm_persistent)] = WiFi.getPersistent();
    root[FPSTR(pgm_bssid)] = WiFi.BSSIDstr();
    root[FPSTR(pgm_rssi)] = WiFi.RSSI();
    root[FPSTR(pgm_sta_ip)] = WiFi.localIP().toString();
    root[FPSTR(pgm_sta_mac)] = WiFi.macAddress();
    root[FPSTR(pgm_ap_ip)] = WiFi.softAPIP().toString();
    root[FPSTR(pgm_ap_mac)] = WiFi.softAPmacAddress();
    root[FPSTR(pgm_gateway)] = WiFi.gatewayIP().toString();
    root[FPSTR(pgm_netmask)] = WiFi.subnetMask().toString();
    root[FPSTR(pgm_dns0)] = WiFi.dnsIP().toString();
    root[FPSTR(pgm_dns1)] = WiFi.dnsIP(1).toString();

    serializeJson(root, *response);
    request->send(response);
  });

  server.on("/status/datetime", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    AsyncResponseStream *response = request->beginResponseStream("application/json");
    // DynamicJsonDocument root(2048);
    StaticJsonDocument<1024> root;

    RtcDateTime dt;
    dt.InitWithEpoch32Time(localTime);

    root["d"] = dt.Day();
    root["m"] = dt.Month();
    root["y"] = dt.Year();
    root["hr"] = dt.Hour();
    root["min"] = dt.Minute();
    root["sec"] = dt.Second();
    // root["tz"] = TimezoneFloat();
    root["tzStr"] = _configLocation.timezonestring;
    root["utc"] = now;
    root["local"] = localTime;

    root[FPSTR(pgm_date)] = getDateStr(localTime);
    root[FPSTR(pgm_time)] = getTimeStr(localTime);
    root[FPSTR(pgm_uptime)] = getUptimeStr();
    root[FPSTR(pgm_lastboot)] = getLastBootStr();
    root[FPSTR(pgm_internetstatus)] = FPSTR(internetstatus_P[internet]);
    root[FPSTR(pgm_rtcstatus)] = FPSTR(rtcstatus_P[GetRtcStatus()]);

    if (syncByRtcFlag)
    {
      root[FPSTR(pgm_lastsyncby)] = FPSTR(pgm_RTC);
    }
    else if (syncByNtpFlag)
    {
      root[FPSTR(pgm_lastsyncby)] = FPSTR(pgm_NTP);
    }
    else
    {
      root[FPSTR(pgm_lastsyncby)] = FPSTR(pgm_None);
    }

    root[FPSTR(pgm_nextsync)] = getNextSyncStr();

    if (lastSyncByNtp)
    {
      root[FPSTR(pgm_lastsyncbyntp)] = getLastSyncStr(lastSyncByNtp);
    }
    else
    {
      root[FPSTR(pgm_lastsyncbyntp)] = FPSTR(pgm_never);
    }

    if (lastSyncByRtc)
    {
      root[FPSTR(pgm_lastsyncbyrtc)] = getLastSyncStr(lastSyncByRtc);
    }
    else
    {
      root[FPSTR(pgm_lastsyncbyrtc)] = FPSTR(pgm_never);
    }

    root["ping_seq_num_send"] = ping_seq_num_send;
    root["ping_seq_num_recv"] = ping_seq_num_recv;

    serializeJson(root, *response);
    request->send(response);
  });

  server.on("/status/heap", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    uint32_t heap = ESP.getFreeHeap();

    AsyncResponseStream *response = request->beginResponseStream("application/json");
    StaticJsonDocument<256> root;
    root["heap"] = heap;
    serializeJson(root, *response);
    request->send(response);
  });

  server.on("/status/mqtt", [](AsyncWebServerRequest *request) {
    DEBUGLOG("%s\r\n", request->url().c_str());

    AsyncResponseStream *response = request->beginResponseStream("application/json");
    StaticJsonDocument<256> root;
    root["connected"] = mqttClient.connected();
    serializeJson(root, *response);
    request->send(response);
  });

  server.begin();
}

void AsyncWSLoop()
{
  ArduinoOTA.handle();
  ws.cleanupClients();
  // dnsServer.processNextRequest();
  // MDNS.update();

  if (tick1000ms)
  {
    if (firmwareUpdated)
    { // check the flag here to determine if a restart is required
      PRINT("Restarting ESP\r\n");
      firmwareUpdated = false;
      ESP.restart();
    }

    if (sendDateTimeFlag)
    {
      sendDateTimeFlag = false;
      sendDateTime(2);
    }
  }

  if (tick3000ms)
  {
  }

  if (stationConnectedFlag)
  {
    stationConnectedFlag = false;
  }

  if (sendFreeHeapStatusFlag)
  {
    sendFreeHeapStatusFlag = false;
    sendHeap(2);
  }

  if (setDateTimeFromGUIFlag)
  {
    setDateTimeFromGUIFlag = false;

    DEBUGLOG("timestamp received: %u\r\n", timestampReceivedFromWebGUI);

    RtcDateTime timeToSetToRTC;
    timeToSetToRTC.InitWithEpoch32Time(timestampReceivedFromWebGUI);

    Rtc.SetDateTime(timeToSetToRTC);

    syncTimeFromRtcFlag = true;

    // lastSyncRTC = utcTimestamp;

    _configTime.lastsync = timestampReceivedFromWebGUI;

    //beep
    tone0 = HIGH;
  }
}
